example/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	
    TOP_BOTTOM
    {
        type            zeroGradient;
    }

    OUTLET
    {
        type           fixedValue;
	value 		uniform 0;
    }

    INLET
    {
        type            zeroGradient;
    }

    FRONT_BACK
    {
        type            empty;
    }

    CYLINDER
    {
        type            zeroGradient;
    }
   

}

// ************************************************************************* //
